Repository: Vincent-C/debian-diffs
Catalog: fontconfig/debian/po/*.po
Languages: de, ro

source: Native
de: Nativ
ro: nativ

source: None
de: Keine
ro: nici unul

source: Font tuning method for screen (system default):
de: Schriftverbesserung für den Bildschirm (Systemvorgabe):

source: Please select the preferred method for tuning fonts for screen rendering.
de: Bitte wählen Sie die bevorzugte Art der Schriftverbesserung bei der Bildschirmdarstellung aus.
ro: Alegeți metoda preferată de ajustare a fonturilor pentru randarea pe ecran.

source: Select 'Native' if you mostly use DejaVu (the default in Debian) or any of the Microsoft fonts. Select 'Autohinter' if you mostly use other TrueType fonts. Select 'None' if you want blurry text.
de: Wählen Sie »Nativ« aus, wenn Sie überwiegend DejaVu (Standard in Debian) oder Microsoft-Schriftarten verwenden. Wählen Sie »Autohinter« aus, wenn sie überwiegend True-Type-Schriftarten verwenden. Wählen Sie »Keine« aus, wenn Sie verschwommenen Text wollen.
ro: Alegeți „nativ” dacă folosiți în general fontul DejaVu (implicit în Debian) sau oricare din fonturile Microsoft. Alegeți „autohinter” dacă utilizați în general alte fonturi TrueType. Alegeți Nici unul dacă doriți text încețoșat.

source: Automatic
de: automatisch
ro: automat

source: Always
de: immer
ro: mereu

source: Never
de: nie
ro: niciodată

source: Enable subpixel rendering for screen:
de: Subpixel-Rendering für den Bildschirm einschalten:
ro: Activează randarea textului pe ecran la nivel de subpixel:

source: Rendering text at a subpixel level generally makes it look a bit better on flat (LCD) screens, but can show color artifacts on CRT screens. The "Automatic" choice will enable it only if a LCD screen is detected.
de: Text-Darstellung auf Subpixel-Ebene verbessert das Aussehen auf Flachbildschirmen (LCD), kann aber Farbfehler auf Röhrenmonitoren (CRT) verursachen. Mit der Einstellung »automatisch« wird es nur eingeschaltet, wenn ein LCD erkannt wurde.
ro: Randarea textului la nivel de subpixel face ca textul să arate, în general, mai bine pe monitoare plate (LCD), dar generează artefacte pe monitoarele CRT. Dacă alegeți „automat” se va activa randarea la nivel de subpixel doar dacă este detectat un monitor LCD.

source: Enable bitmapped fonts by default?
de: Standardmäßig Bitmap-Schriftarten verwenden?
ro: Se activează implicit fonturile bitmap?

source: By default, only outline fonts are used by applications which support fontconfig.
de: Standardmäßig nutzen Anwendungen, die fontconfig unterstützen, nur Outline-Schriftarten.
ro: În mod implicit, numai fonturile vectoriale sunt folosite de aplicațiile caresuportă fontconfig.

source: Outline fonts are fonts which scale well to various sizes. In contrast, bitmapped fonts are often lower quality. Enabling this option will affect the systemwide default; this and many other fontconfig options may be enabled or disabled on a per-user basis.
de: Outline-Schriftarten können gut in verschiedene Größen skaliert werden. Bitmap-Schriftarten sind im Gegensatz dazu oft von geringerer Qualität. Wenn Sie hier zustimmen, beeinflussen Sie die systemweite Standardeinstellung; diese und viele andere Einstellungen von Fontconfig können benutzerbezogen ein- und ausgeschaltet werden.
ro: Implicit, aplicațiile care suportă fontconfig folosesc doar fonturi vectoriale. Fonturile vectoriale sunt fonturi care arată bine indiferent de mărimea caracterului, spre deosebire de fonturile bitmap nu arată bine la dimensiuni mai mari. Această opțiune afectează valoarea implicită a sistemului și poate fi activată sau deazactivată, pentru fiecare utilizator în parte, la fel ca multe alte opțiuni fontconfig.
